---
kind: method
id: M:Autodesk.Revit.DB.ValueAtPointBase.SetFlags(System.Int32)
source: html/80ea41b0-f274-8e7f-25f8-79f9fdeddb33.htm
---
# Autodesk.Revit.DB.ValueAtPointBase.SetFlags Method

Sets the flags associated to all measurements to the same value.

## Syntax (C#)
```csharp
public void SetFlags(
	int flags
)
```

## Parameters
- **flags** (`System.Int32`) - Value of flags, uniform for all measurements.
 Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.